app/controllers/blogs_controller.rb

  def create
   @blog = Blog.new(blog_params)
   if params[:back]
     render :new
   else
     if @blog.save
---
INSERT INTO "blogs" ("title", "content") VALUES ($1, $2) RETURNING "id"  [["title", "tunomaki"], ["content", "wakaranan"]]

  def update
    @blog = Blog.find(params[:id])
       if @blog.update(blog_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "blogs" SET "content" = $1 WHERE "blogs"."id" = $2  [["content", "こんばんどどどhh"], ["id", 17]]