app/controllers/contacts_controller.rb

 def create
   Contact.create(name: params[:contact][:name], email: params[:contact][:email],content:params[:contact][:content])
---
INSERT INTO "contacts" ("name", "email", "content") VALUES ($1, $2, $3) RETURNING "id"  [["name", "ウノ　ケンイチ"], ["email", "unokain@gmail.com"], ["content", "jj"]]